99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_driver/esp32_mquickjs_wifi_driver.c
#include "cutils.h"
#include "esp32_mquickjs_wifi.h"
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
#include "esp32_mquickjs_core.h"
#include "esp32_mquickjs_options.h"
#include "esp32_mquickjs_wifi_tx_rate.h"
#include "esp32_mquickjs_wifi_antenna.h"
#include "esp32_mquickjs_wifi_scan_parameters.h"
#include "esp32_mquickjs_memory.h"
#include "esp32_mquickjs_wireless_core.h"
#include "esp32_mquickjs_wifi_config_observations.inc"
#include <string.h>

static bool tx_rate_interface(JSContext *ctx, JSValue value, wifi_interface_t *interface)
{
    if (!JS_IsString(ctx, value)) goto invalid;
    JSCStringBuf buffer;
    size_t length;
    const char *text = JS_ToCStringLen(ctx, &length, value, &buffer);
    if (text == NULL) return false;
    if (length == 7 && memcmp(text, "station", 7) == 0) {
        *interface = WIFI_IF_STA;
        return true;
    }
    if (length == 12 && memcmp(text, "access-point", 12) == 0) {
        *interface = WIFI_IF_AP;
        return true;
    }
invalid:
    JS_ThrowTypeError(ctx, "Wi-Fi interface must be station or access-point");
    return false;
}

/* Every getter runs once with rooted options/value; only native scalars escape.
 * Validation finishes before taking the Radio mutation mutex or calling SDK. */
bool esp32_mquickjs_wifi_tx_rate_capture(JSContext *ctx, JSValue input, wifi_tx_rate_config_t *config)
{
    static const char *const keys[] = {"phy", "rate", "ersu", "dcm"};
    static const wifi_phy_mode_t modes[] = {WIFI_PHY_MODE_LR, WIFI_PHY_MODE_11B,
        WIFI_PHY_MODE_11G, WIFI_PHY_MODE_11A, WIFI_PHY_MODE_HT20, WIFI_PHY_MODE_HT40,
        WIFI_PHY_MODE_HE20, WIFI_PHY_MODE_VHT20};
    JSGCRef options_ref, value_ref;
    JSValue *options = JS_PushGCRef(ctx, &options_ref);
    JSValue *value = JS_PushGCRef(ctx, &value_ref);
    *options = input;
    *config = (wifi_tx_rate_config_t){0};
    if (!esp32_mquickjs_validate_plain_options(ctx, *options,
        "wifi.driver.configureTxRate", keys, sizeof(keys) / sizeof(*keys))) goto fail;
    for (unsigned field = 0; field < 2; ++field) {
        *value = JS_GetPropertyStr(ctx, *options, keys[field]);
        if (JS_IsException(*value)) goto fail;
        if (!JS_IsString(ctx, *value)) goto invalid;
        JSCStringBuf buffer;
        size_t length;
        const char *text = JS_ToCStringLen(ctx, &length, *value, &buffer);
        if (text == NULL) goto fail;
        bool found = false;
        if (field == 0) {
            for (unsigned i = 0; i < sizeof(modes) / sizeof(*modes); ++i) {
                const char *name = esp32_mquickjs_wifi_tx_phy_name(modes[i]);
                if (name != NULL && length == strlen(name) && memcmp(text, name, length) == 0) {
                    config->phymode = modes[i]; found = true; break;
                }
            }
        } else {
            size_t count;
            const esp32_mquickjs_wifi_tx_rate_entry_t *entries = esp32_mquickjs_wifi_tx_rate_entries(&count);
            for (size_t i = 0; i < count; ++i) {
                if (length == strlen(entries[i].name) && memcmp(text, entries[i].name, length) == 0) {
                    config->rate = entries[i].rate; found = true; break;
                }
            }
        }
        if (!found) goto invalid;
    }
    for (unsigned field = 2; field < 4; ++field) {
        *value = JS_GetPropertyStr(ctx, *options, keys[field]);
        if (JS_IsException(*value)) goto fail;
        if (JS_IsUndefined(*value)) continue;
        if (!JS_IsBool(*value)) goto invalid;
        if (field == 2) config->ersu = *value == JS_TRUE;
        else config->dcm = *value == JS_TRUE;
    }
    if (!esp32_mquickjs_wifi_tx_rate_valid(config)) goto invalid;
    JS_PopGCRef(ctx, &value_ref);
    JS_PopGCRef(ctx, &options_ref);
    return true;
invalid:
    JS_ThrowTypeError(ctx, "Invalid or target-unsupported Wi-Fi PHY/rate combination or boolean option");
fail:
    JS_PopGCRef(ctx, &value_ref);
    JS_PopGCRef(ctx, &options_ref);
    return false;
}

static JSValue tx_rate_status_to_js(JSContext *ctx, wifi_interface_t interface,
    const esp32_mquickjs_wifi_tx_rate_record_t *record, uint32_t generation,
    const esp32_mquickjs_wifi_tx_rate_lease_t *temporary)
{
    JSGCRef result_ref, config_ref, temporary_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    JSValue *config = JS_PushGCRef(ctx, &config_ref);
    JSValue *lease = JS_PushGCRef(ctx, &temporary_ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
    bool known = record->known && record->generation == generation;
#define SET(object, name, expression) do { \
    if (!esp32_mquickjs_set_property_ref(ctx, object, name, expression)) goto fail; \
} while (0)
    SET(result, "interface", JS_NewString(ctx, interface == WIFI_IF_STA ? "station" : "access-point"));
    SET(result, "known", JS_NewBool(known));
    SET(result, "uncertain", JS_NewBool(record->uncertain));
    SET(result, "source", known ? JS_NewString(ctx, "framework-write") : JS_NULL);
    SET(result, "radioGeneration", JS_NewUint32(ctx, generation));
    SET(result, "writeGeneration", JS_NewUint32(ctx, record->generation));
    SET(result, "writeIdentity", JS_NewUint32(ctx, record->write_identity));
    SET(result, "error", record->error != ESP_OK ? JS_NewInt32(ctx, record->error) : JS_NULL);
    SET(result, "rollbackError", record->rollback_error != ESP_OK ? JS_NewInt32(ctx, record->rollback_error) : JS_NULL);
    *config = JS_NULL;
    if (known) {
        *config = JS_NewObject(ctx);
        if (JS_IsException(*config)) goto fail;
        SET(config, "phy", JS_NewString(ctx, esp32_mquickjs_wifi_tx_phy_name(record->config.phymode)));
        SET(config, "rate", JS_NewString(ctx, esp32_mquickjs_wifi_tx_rate_name(record->config.rate)));
        SET(config, "ersu", JS_NewBool(record->config.ersu));
        SET(config, "dcm", JS_NewBool(record->config.dcm));
    }
    SET(result, "config", *config);
    *lease = JS_NULL;
    if (temporary != NULL && temporary->identity != 0U) {
        *lease = JS_NewObject(ctx);
        if (JS_IsException(*lease)) goto fail;
        SET(lease, "radioGeneration", JS_NewUint32(ctx, temporary->generation));
        SET(lease, "radioLeaseIdentity", JS_NewUint32(ctx, temporary->identity));
        SET(lease, "writeIdentity", JS_NewUint32(ctx, temporary->write_identity));
        SET(lease, "restorePending", JS_NewBool(temporary->restore_pending));
        SET(lease, "restoreError", temporary->restore_error != ESP_OK ? JS_NewInt32(ctx, temporary->restore_error) : JS_NULL);
        *config = JS_NewObject(ctx);
        if (JS_IsException(*config)) goto fail;
        SET(config, "phy", JS_NewString(ctx, esp32_mquickjs_wifi_tx_phy_name(temporary->previous.phymode)));
        SET(config, "rate", JS_NewString(ctx, esp32_mquickjs_wifi_tx_rate_name(temporary->previous.rate)));
        SET(config, "ersu", JS_NewBool(temporary->previous.ersu));
        SET(config, "dcm", JS_NewBool(temporary->previous.dcm));
        SET(lease, "previous", *config);
    }
    SET(result, "temporaryLease", *lease);
#undef SET
    JS_PopGCRef(ctx, &temporary_ref);
    JS_PopGCRef(ctx, &config_ref);
    return JS_PopGCRef(ctx, &result_ref);
fail:
    JS_PopGCRef(ctx, &temporary_ref);
    JS_PopGCRef(ctx, &config_ref);
    JS_PopGCRef(ctx, &result_ref);
    return JS_EXCEPTION;
}

static JSValue tx_rate_error(JSContext *ctx, const char *operation, esp_err_t err,
    const esp32_mquickjs_wifi_tx_rate_write_t *write, wifi_interface_t interface,
    const esp32_mquickjs_wifi_tx_rate_record_t *record, uint32_t generation,
    const esp32_mquickjs_wifi_tx_rate_lease_t *temporary)
{
    JSGCRef details_ref;
    JSValue *details = JS_PushGCRef(ctx, &details_ref);
    *details = tx_rate_status_to_js(ctx, interface, record, generation, temporary);
    if (JS_IsException(*details) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "espCode", JS_NewInt32(ctx, err)) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "stage", JS_NewString(ctx, write->attempted ? "write" : "admission")) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "attempted", JS_NewBool(write->attempted)) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "driverAccepted", JS_NewBool(write->accepted)) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "rollbackAttempted", JS_NewBool(write->rollback_attempted)) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "restored", JS_NewBool(write->restored))) {
        JS_PopGCRef(ctx, &details_ref);
        return JS_EXCEPTION;
    }
    JSValue result = esp32_mquickjs_throw_native_error(ctx, "WIFI_TX_RATE_FAILED", operation,
        "Wi-Fi TX rate operation failed", *details);
    JS_PopGCRef(ctx, &details_ref);
    return result;
}

