99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_driver/esp32_mquickjs_wifi_driver.c
static JSValue driver_protocols_to_js(JSContext *ctx, uint16_t bits)
{
    static const char *const names[] = {"11b", "11g", "11n", "11a", "11ac", "11ax", "lr"};
    static const uint16_t flags[] = {WIFI_PROTOCOL_11B, WIFI_PROTOCOL_11G, WIFI_PROTOCOL_11N,
        WIFI_PROTOCOL_11A, WIFI_PROTOCOL_11AC, WIFI_PROTOCOL_11AX, WIFI_PROTOCOL_LR};
    JSGCRef array_ref, item_ref;
    JSValue *array = JS_PushGCRef(ctx, &array_ref);
    JSValue *item = JS_PushGCRef(ctx, &item_ref);
    *array = JS_NewArray(ctx, 0);
    if (JS_IsException(*array)) goto fail;
    uint32_t count = 0;
    for (size_t i = 0; i < sizeof(flags) / sizeof(*flags); ++i) {
        if (!(bits & flags[i])) continue;
        *item = JS_NewString(ctx, names[i]);
        if (JS_IsException(*item) || JS_IsException(JS_SetPropertyUint32(ctx, *array, count++, *item))) goto fail;
    }
    JS_PopGCRef(ctx, &item_ref);
    return JS_PopGCRef(ctx, &array_ref);
fail:
    JS_PopGCRef(ctx, &item_ref);
    JS_PopGCRef(ctx, &array_ref);
    return JS_EXCEPTION;
}

/* Only validated native snapshots reach conversion; native reads hold no JS roots. */
static JSValue driver_phy_to_js(JSContext *ctx, esp32_mquickjs_wifi_phy_query_t query,
    const esp32_mquickjs_wifi_phy_readback_t *value)
{
    if (query == ESP32_MQUICKJS_WIFI_PHY_PROTOCOL) return driver_protocols_to_js(ctx, value->protocols.ghz_2g);
    if (query == ESP32_MQUICKJS_WIFI_PHY_BANDWIDTH) return JS_NewInt32(ctx, value->bandwidths.ghz_2g == WIFI_BW20 ? 20 : 40);
    bool protocol = query == ESP32_MQUICKJS_WIFI_PHY_PROTOCOLS;
    JSGCRef result_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
    for (unsigned band = 1; band <= 2; band <<= 1) {
        if (!(value->bands & band)) continue;
        const char *key = protocol ? (band == 1 ? "ghz2" : "ghz5") : (band == 1 ? "ghz2MHz" : "ghz5MHz");
        uint16_t bits = band == 1 ? value->protocols.ghz_2g : value->protocols.ghz_5g;
        wifi_bandwidth_t width = band == 1 ? value->bandwidths.ghz_2g : value->bandwidths.ghz_5g;
        if (!esp32_mquickjs_set_property_ref(ctx, result, key, protocol ? driver_protocols_to_js(ctx, bits)
            : JS_NewInt32(ctx, width == WIFI_BW20 ? 20 : 40))) goto fail;
    }
    return JS_PopGCRef(ctx, &result_ref);
fail:
    JS_PopGCRef(ctx, &result_ref);
    return JS_EXCEPTION;
}

static JSValue driver_read_error(JSContext *ctx, const char *interface,
    const char *operation, esp_err_t err, const char *stage)
{
    JSGCRef details_ref;
    JSValue *details = JS_PushGCRef(ctx, &details_ref);
    *details = JS_NewObject(ctx);
    if (JS_IsException(*details) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "espCode", JS_NewInt32(ctx, err)) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "stage", JS_NewString(ctx, stage)) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "interface", interface != NULL ? JS_NewString(ctx, interface) : JS_NULL)) {
        JS_PopGCRef(ctx, &details_ref);
        return JS_EXCEPTION;
    }
    JSValue result = esp32_mquickjs_throw_native_error(ctx, "WIFI_DRIVER_READ_FAILED", operation,
        "Wi-Fi driver read failed", *details);
    JS_PopGCRef(ctx, &details_ref);
    return result;
}

static JSValue driver_antenna_to_js(JSContext *ctx, bool gpio,
    const esp32_mquickjs_wifi_antenna_snapshot_t *snapshot)
{
    JSGCRef root_ref, array_ref, item_ref;
    JSValue *root = JS_PushGCRef(ctx, &root_ref);
    JSValue *array = JS_PushGCRef(ctx, &array_ref);
    JSValue *item = JS_PushGCRef(ctx, &item_ref);
    *root = JS_NewObject(ctx);
    if (JS_IsException(*root)) goto fail;
    if (gpio) {
        *array = JS_NewArray(ctx, 4);
        if (JS_IsException(*array)) goto fail;
        for (unsigned i = 0; i < 4; ++i) {
            *item = JS_NewObject(ctx);
            if (JS_IsException(*item) ||
                !esp32_mquickjs_set_property_ref(ctx, item, "selected", JS_NewBool(snapshot->gpio.gpio_cfg[i].gpio_select)) ||
                !esp32_mquickjs_set_property_ref(ctx, item, "gpio", JS_NewUint32(ctx, snapshot->gpio.gpio_cfg[i].gpio_num)) ||
                JS_IsException(JS_SetPropertyUint32(ctx, *array, i, *item))) goto fail;
        }
        if (!esp32_mquickjs_set_property_ref(ctx, root, "gpios", *array)) goto fail;
    } else {
        const esp_phy_ant_config_t *config = &snapshot->config;
        if (!esp32_mquickjs_set_property_ref(ctx, root, "rxMode", JS_NewString(ctx,
                config->rx_ant_mode == ESP_PHY_ANT_MODE_ANT0 ? "ant0" : config->rx_ant_mode == ESP_PHY_ANT_MODE_ANT1 ? "ant1" : "auto")) ||
            !esp32_mquickjs_set_property_ref(ctx, root, "txMode", JS_NewString(ctx,
                config->tx_ant_mode == ESP_PHY_ANT_MODE_ANT0 ? "ant0" : config->tx_ant_mode == ESP_PHY_ANT_MODE_ANT1 ? "ant1" : "auto")) ||
            !esp32_mquickjs_set_property_ref(ctx, root, "rxDefault", JS_NewString(ctx,
                config->rx_ant_default == ESP_PHY_ANT_ANT0 ? "ant0" : "ant1")) ||
            !esp32_mquickjs_set_property_ref(ctx, root, "enabledAnt0", JS_NewUint32(ctx, config->enabled_ant0)) ||
            !esp32_mquickjs_set_property_ref(ctx, root, "enabledAnt1", JS_NewUint32(ctx, config->enabled_ant1))) goto fail;
    }
    JS_PopGCRef(ctx, &item_ref);
    JS_PopGCRef(ctx, &array_ref);
    return JS_PopGCRef(ctx, &root_ref);
fail:
    JS_PopGCRef(ctx, &item_ref);
    JS_PopGCRef(ctx, &array_ref);
    JS_PopGCRef(ctx, &root_ref);
    return JS_EXCEPTION;
}

static JSValue driver_read_antenna(JSContext *ctx, int argc, bool gpio, const char *operation)
{
    if (argc != 0) return JS_ThrowTypeError(ctx, "%s expects no arguments", operation);
    esp32_mquickjs_wifi_antenna_snapshot_t snapshot;
    const char *stage;
    esp_err_t err = esp32_mquickjs_wifi_radio_read_antenna(gpio, &snapshot, &stage);
    if (err != ESP_OK) return driver_read_error(ctx, NULL, operation, err, stage);
    return driver_antenna_to_js(ctx, gpio, &snapshot);
}

JSValue js_wifi_driver_get_antenna(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val; (void)argv;
    return driver_read_antenna(ctx, argc, false, "wifi.driver.getAntenna");
}

JSValue js_wifi_driver_get_antenna_gpio(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val; (void)argv;
    return driver_read_antenna(ctx, argc, true, "wifi.driver.getAntennaGpio");
}

static JSValue driver_state_to_js(JSContext *ctx, esp32_mquickjs_wifi_driver_state_query_t query,
    const esp32_mquickjs_wifi_driver_state_readback_t *value)
{
    if (query == ESP32_MQUICKJS_WIFI_DRIVER_STATE_MODE) {
        const char *mode = value->mode == WIFI_MODE_NULL ? "off" : value->mode == WIFI_MODE_STA ? "station" :
            value->mode == WIFI_MODE_AP ? "softAP" : "station+softAP";
        return JS_NewString(ctx, mode);
    }
    if (query == ESP32_MQUICKJS_WIFI_DRIVER_STATE_COUNTRY)
        return esp32_mquickjs_wifi_country_to_js(ctx, &value->country);
    JSGCRef result_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    *result = JS_NewObject(ctx);
    const char *secondary = value->secondary == WIFI_SECOND_CHAN_NONE ? "none" :
        value->secondary == WIFI_SECOND_CHAN_ABOVE ? "above" : "below";
    if (JS_IsException(*result) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "channel", JS_NewUint32(ctx, value->channel)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "secondaryChannel", JS_NewString(ctx, secondary)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "band", JS_NewString(ctx, value->channel <= 14 ? "2.4GHz" : "5GHz")) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "channelGeneration",
            query == ESP32_MQUICKJS_WIFI_DRIVER_STATE_HOME_CHANNEL ? JS_NULL : JS_NewUint32(ctx, value->channel_generation))) {
        JS_PopGCRef(ctx, &result_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &result_ref);
}

static JSValue driver_read_state(JSContext *ctx, int argc,
    esp32_mquickjs_wifi_driver_state_query_t query, const char *operation)
{
    if (argc != 0) return JS_ThrowTypeError(ctx, "%s expects no arguments", operation);
    esp32_mquickjs_wifi_driver_state_readback_t value;
    const char *stage;
    esp_err_t err = esp32_mquickjs_wifi_radio_read_state(query, &value, &stage);
    if (err != ESP_OK) return driver_read_error(ctx, NULL, operation, err, stage);
    return driver_state_to_js(ctx, query, &value);
}

JSValue js_wifi_driver_get_mode(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argv;
    return driver_read_state(ctx, argc, ESP32_MQUICKJS_WIFI_DRIVER_STATE_MODE, "wifi.driver.getMode");
}

JSValue js_wifi_driver_get_country(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argv;
    return driver_read_state(ctx, argc, ESP32_MQUICKJS_WIFI_DRIVER_STATE_COUNTRY, "wifi.driver.getCountry");
}

JSValue js_wifi_driver_get_channel(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argv;
    return driver_read_state(ctx, argc, ESP32_MQUICKJS_WIFI_DRIVER_STATE_CHANNEL, "wifi.driver.getChannel");
}

JSValue js_wifi_driver_get_home_channel(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argv;
    return driver_read_state(ctx, argc, ESP32_MQUICKJS_WIFI_DRIVER_STATE_HOME_CHANNEL, "wifi.driver.getHomeChannel");
}

static JSValue driver_read_phy(JSContext *ctx, int argc, JSValue *argv,
    esp32_mquickjs_wifi_phy_query_t query, const char *operation)
{
    if (argc != 1) return JS_ThrowTypeError(ctx, "%s(interface) expects one argument", operation);
    wifi_interface_t interface;
    if (!tx_rate_interface(ctx, argv[0], &interface)) return JS_EXCEPTION;
    esp32_mquickjs_wifi_phy_readback_t value;
    const char *stage;
    esp_err_t err = esp32_mquickjs_wifi_radio_read_phy(interface, query, &value, &stage);
    if (err == ESP_OK) return driver_phy_to_js(ctx, query, &value);
    return driver_read_error(ctx, interface == WIFI_IF_STA ? "station" : "access-point", operation, err, stage);
}

