99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_driver/esp32_mquickjs_wifi_driver.c
static JSValue driver_scalar_to_js(JSContext *ctx, esp32_mquickjs_wifi_driver_query_t query, int64_t value)
{
    /* Native boundary validated enums, units and exact integer range. */
    switch (query) {
    case ESP32_MQUICKJS_WIFI_DRIVER_BAND:
        return JS_NewString(ctx, value == WIFI_BAND_2G ? "2.4GHz" : "5GHz");
    case ESP32_MQUICKJS_WIFI_DRIVER_BAND_MODE:
        return JS_NewString(ctx, value == WIFI_BAND_MODE_2G_ONLY ? "2.4GHz-only" :
            value == WIFI_BAND_MODE_5G_ONLY ? "5GHz-only" : "auto");
    case ESP32_MQUICKJS_WIFI_DRIVER_POWER_SAVE:
        return JS_NewString(ctx, value == WIFI_PS_NONE ? "none" : value == WIFI_PS_MIN_MODEM ? "minimum" : "maximum");
    case ESP32_MQUICKJS_WIFI_DRIVER_NEGOTIATED_PHY:
        return JS_NewString(ctx, esp32_mquickjs_wifi_tx_phy_name((wifi_phy_mode_t)value));
    case ESP32_MQUICKJS_WIFI_DRIVER_TX_POWER:
        return JS_NewFloat64(ctx, (double)value / 4.0);
    default:
        return JS_NewInt64(ctx, value);
    }
}

static JSValue driver_read_scalar(JSContext *ctx, int argc, JSValue *argv,
    esp32_mquickjs_wifi_driver_query_t query, const char *operation)
{
    bool by_interface = query == ESP32_MQUICKJS_WIFI_DRIVER_TSF_TIME || query == ESP32_MQUICKJS_WIFI_DRIVER_INACTIVE_TIME;
    if (argc != (by_interface ? 1 : 0)) return JS_ThrowTypeError(ctx, "%s expects %d arguments", operation, by_interface ? 1 : 0);
    wifi_interface_t interface = WIFI_IF_STA;
    if (by_interface && !tx_rate_interface(ctx, argv[0], &interface)) return JS_EXCEPTION;
    int64_t value;
    const char *stage;
    esp_err_t err = esp32_mquickjs_wifi_radio_read_driver(query, interface, &value, &stage);
    if (err == ESP_OK) return driver_scalar_to_js(ctx, query, value);
    bool station = query == ESP32_MQUICKJS_WIFI_DRIVER_RSSI || query == ESP32_MQUICKJS_WIFI_DRIVER_AID ||
                   query == ESP32_MQUICKJS_WIFI_DRIVER_NEGOTIATED_PHY;
    const char *name = by_interface ? (interface == WIFI_IF_STA ? "station" : "access-point") : station ? "station" : NULL;
    return driver_read_error(ctx, name, operation, err, stage);
}

JSValue js_wifi_driver_get_band(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    return driver_read_scalar(ctx, argc, argv, ESP32_MQUICKJS_WIFI_DRIVER_BAND, "wifi.driver.getBand");
}

JSValue js_wifi_driver_get_band_mode(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    return driver_read_scalar(ctx, argc, argv, ESP32_MQUICKJS_WIFI_DRIVER_BAND_MODE, "wifi.driver.getBandMode");
}

JSValue js_wifi_driver_get_power_save(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    return driver_read_scalar(ctx, argc, argv, ESP32_MQUICKJS_WIFI_DRIVER_POWER_SAVE, "wifi.driver.getPowerSave");
}

JSValue js_wifi_driver_get_tx_power(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    return driver_read_scalar(ctx, argc, argv, ESP32_MQUICKJS_WIFI_DRIVER_TX_POWER, "wifi.driver.getTxPower");
}

JSValue js_wifi_driver_get_rssi(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    return driver_read_scalar(ctx, argc, argv, ESP32_MQUICKJS_WIFI_DRIVER_RSSI, "wifi.driver.getRssi");
}

JSValue js_wifi_driver_get_aid(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    return driver_read_scalar(ctx, argc, argv, ESP32_MQUICKJS_WIFI_DRIVER_AID, "wifi.driver.getAid");
}

JSValue js_wifi_driver_get_negotiated_phy(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    return driver_read_scalar(ctx, argc, argv, ESP32_MQUICKJS_WIFI_DRIVER_NEGOTIATED_PHY, "wifi.driver.getNegotiatedPhy");
}

JSValue js_wifi_driver_get_tsf_time(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    return driver_read_scalar(ctx, argc, argv, ESP32_MQUICKJS_WIFI_DRIVER_TSF_TIME, "wifi.driver.getTsfTime");
}

JSValue js_wifi_driver_get_inactive_time(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    return driver_read_scalar(ctx, argc, argv, ESP32_MQUICKJS_WIFI_DRIVER_INACTIVE_TIME, "wifi.driver.getInactiveTime");
}


JSValue js_wifi_driver_get_protocol(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    return driver_read_phy(ctx, argc, argv, ESP32_MQUICKJS_WIFI_PHY_PROTOCOL, "wifi.driver.getProtocol");
}

JSValue js_wifi_driver_get_protocols(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    return driver_read_phy(ctx, argc, argv, ESP32_MQUICKJS_WIFI_PHY_PROTOCOLS, "wifi.driver.getProtocols");
}

JSValue js_wifi_driver_get_bandwidth(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    return driver_read_phy(ctx, argc, argv, ESP32_MQUICKJS_WIFI_PHY_BANDWIDTH, "wifi.driver.getBandwidth");
}

JSValue js_wifi_driver_get_bandwidths(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    return driver_read_phy(ctx, argc, argv, ESP32_MQUICKJS_WIFI_PHY_BANDWIDTHS, "wifi.driver.getBandwidths");
}

static bool driver_phy_capture(JSContext *ctx, JSValue input,
    esp32_mquickjs_wifi_phy_query_t query, esp32_mquickjs_wifi_phy_readback_t *output)
{
    bool protocol = query == ESP32_MQUICKJS_WIFI_PHY_PROTOCOL || query == ESP32_MQUICKJS_WIFI_PHY_PROTOCOLS;
    bool plural = query == ESP32_MQUICKJS_WIFI_PHY_PROTOCOLS || query == ESP32_MQUICKJS_WIFI_PHY_BANDWIDTHS;
    static const char *const protocol_keys[] = {"ghz2", "ghz5"};
    static const char *const width_keys[] = {"ghz2MHz", "ghz5MHz"};
    const char *const *keys = protocol ? protocol_keys : width_keys;
    JSGCRef root_ref, value_ref;
    JSValue *root = JS_PushGCRef(ctx, &root_ref);
    JSValue *value = JS_PushGCRef(ctx, &value_ref);
    *root = input;
    esp32_mquickjs_wifi_phy_readback_t captured = {0};
    memset(output, 0, sizeof(*output));
    if (plural && !esp32_mquickjs_validate_plain_options(ctx, *root, "wifi.driver PHY config", keys, 2)) goto fail;
    for (unsigned band = 0; band < (plural ? 2U : 1U); ++band) {
        *value = plural ? JS_GetPropertyStr(ctx, *root, keys[band]) : *root;
        if (JS_IsException(*value)) goto fail;
        if (plural && JS_IsUndefined(*value)) continue;
        if (protocol) {
            uint16_t bitmap;
            if (!esp32_mquickjs_wifi_capture_protocol(ctx, *value, &bitmap)) goto fail;
            if (band == 0) captured.protocols.ghz_2g = bitmap;
            else captured.protocols.ghz_5g = bitmap;
        } else {
            uint32_t mhz;
            if (!esp32_mquickjs_value_to_bounded_u32(ctx, *value, 20, 40, &mhz) || (mhz != 20 && mhz != 40)) goto fail;
            wifi_bandwidth_t width = mhz == 20 ? WIFI_BW20 : WIFI_BW40;
            if (band == 0) captured.bandwidths.ghz_2g = width;
            else captured.bandwidths.ghz_5g = width;
        }
        captured.bands |= 1U << band;
    }
    if (captured.bands == 0U) goto fail;
    *output = captured;
    JS_PopGCRef(ctx, &value_ref);
    JS_PopGCRef(ctx, &root_ref);
    return true;
fail:
    if (!JS_HasException(ctx)) JS_ThrowTypeError(ctx, "Wi-Fi PHY config requires nonempty unique protocol names or 20/40 MHz");
    JS_PopGCRef(ctx, &value_ref);
    JS_PopGCRef(ctx, &root_ref);
    return false;
}

static JSValue driver_phy_write_error(JSContext *ctx, wifi_interface_t interface,
    const char *operation, const esp32_mquickjs_wifi_radio_config_result_t *result)
{
    JSGCRef details_ref;
    JSValue *details = JS_PushGCRef(ctx, &details_ref);
    *details = JS_NewObject(ctx);
    if (JS_IsException(*details) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "interface",
            interface == WIFI_IF_STA || interface == WIFI_IF_AP ? JS_NewString(ctx,
                interface == WIFI_IF_STA ? "station" : "access-point") : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "espCode", JS_NewInt32(ctx, result->error)) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "stage", JS_NewString(ctx, result->stage)) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "mutationAttempted", JS_NewBool(result->mutation_attempted)) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "rollbackAttempted", JS_NewBool(result->rollback_attempted)) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "rollbackComplete", JS_NewBool(result->rollback_complete)) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "rollbackStage", result->rollback_stage != NULL ? JS_NewString(ctx, result->rollback_stage) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "rollbackError", JS_NewInt32(ctx, result->rollback_error)) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "persistentMutationPossible", JS_NewBool(result->persistent_mutation_possible))) {
        JS_PopGCRef(ctx, &details_ref);
        return JS_EXCEPTION;
    }
    JSValue error = esp32_mquickjs_throw_native_error(ctx, "WIFI_DRIVER_WRITE_FAILED", operation,
        "Wi-Fi driver configuration write failed", *details);
    JS_PopGCRef(ctx, &details_ref);
    return error;
}

static JSValue driver_config_bytes(JSContext *ctx, const uint8_t *data, size_t length)
{
    JSGCRef array_ref;
    JSValue *array = JS_PushGCRef(ctx, &array_ref);
    *array = JS_NewArray(ctx, 0);
    if (JS_IsException(*array)) goto fail;
    for (uint32_t i = 0; i < length; ++i) {
        JSValue value = JS_NewUint32(ctx, data[i]);
        if (JS_IsException(value) || JS_IsException(JS_SetPropertyUint32(ctx, *array, i, value))) goto fail;
    }
    return JS_PopGCRef(ctx, &array_ref);
fail:
    JS_PopGCRef(ctx, &array_ref);
    return JS_EXCEPTION;
}

static JSValue driver_config_text(JSContext *ctx, const uint8_t *data, size_t length)
{
    for (size_t offset = 0; offset < length;) {
        size_t consumed;
        int codepoint = unicode_from_utf8(data + offset, length - offset, &consumed);
        if (codepoint < 0 || (codepoint >= 0xd800 && codepoint <= 0xdfff)) return JS_NULL;
        offset += consumed;
    }
    return JS_NewStringLen(ctx, (const char *)data, length);
}

static JSValue driver_config_enum(JSContext *ctx, int id, const char *name)
{
    JSGCRef result_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "id", JS_NewInt32(ctx, id)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "name", name != NULL ? JS_NewString(ctx, name) : JS_NULL)) {
        JS_PopGCRef(ctx, &result_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &result_ref);
}

static const char *driver_config_scan_name(int id)
{
    return id == WIFI_FAST_SCAN ? "fast" : id == WIFI_ALL_CHANNEL_SCAN ? "all-channel" : NULL;
}

static const char *driver_config_sort_name(int id)
{
    return id == WIFI_CONNECT_AP_BY_SIGNAL ? "signal" : id == WIFI_CONNECT_AP_BY_SECURITY ? "security" : NULL;
}

static const char *driver_config_auth_name(int id)
{
    switch (id) {
    case WIFI_AUTH_OPEN: return "open";
    case WIFI_AUTH_WEP: return "wep";
    case WIFI_AUTH_WPA_PSK: return "wpa";
    case WIFI_AUTH_WPA2_PSK: return "wpa2";
    case WIFI_AUTH_WPA_WPA2_PSK: return "wpa/wpa2";
    case WIFI_AUTH_WPA2_ENTERPRISE: return "wpa2-enterprise";
    case WIFI_AUTH_WPA3_PSK: return "wpa3";
    case WIFI_AUTH_WPA2_WPA3_PSK: return "wpa2/wpa3";
    case WIFI_AUTH_WAPI_PSK: return "wapi";
    case WIFI_AUTH_OWE: return "owe";
    case WIFI_AUTH_WPA3_ENT_192: return "wpa3-enterprise-192";
    case WIFI_AUTH_DPP: return "dpp";
    case WIFI_AUTH_WPA3_ENTERPRISE: return "wpa3-enterprise";
    case WIFI_AUTH_WPA2_WPA3_ENTERPRISE: return "wpa2/wpa3-enterprise";
    case WIFI_AUTH_WPA_ENTERPRISE: return "wpa-enterprise";
    case WIFI_AUTH_UNKNOWN: return "unknown";
    default: return NULL;
    }
}

static const char *driver_config_pwe_name(int id)
{
    switch (id) {
    case WPA3_SAE_PWE_UNSPECIFIED: return "unspecified";
    case WPA3_SAE_PWE_HUNT_AND_PECK: return "hunting-and-pecking";
    case WPA3_SAE_PWE_HASH_TO_ELEMENT: return "hash-to-element";
    case WPA3_SAE_PWE_BOTH: return "both";
    default: return NULL;
    }
}

static const char *driver_config_pk_name(int id)
{
    switch (id) {
    case WPA3_SAE_PK_MODE_AUTOMATIC: return "automatic";
    case WPA3_SAE_PK_MODE_ONLY: return "only";
    case WPA3_SAE_PK_MODE_DISABLED: return "disabled";
    default: return NULL;
    }
}

static const char *driver_config_cipher_name(int id)
{
    switch (id) {
    case WIFI_CIPHER_TYPE_NONE: return "none";
    case WIFI_CIPHER_TYPE_WEP40: return "wep40";
    case WIFI_CIPHER_TYPE_WEP104: return "wep104";
    case WIFI_CIPHER_TYPE_TKIP: return "tkip";
    case WIFI_CIPHER_TYPE_CCMP: return "ccmp";
    case WIFI_CIPHER_TYPE_TKIP_CCMP: return "tkip/ccmp";
    case WIFI_CIPHER_TYPE_AES_CMAC128: return "aes-cmac128";
    case WIFI_CIPHER_TYPE_SMS4: return "sms4";
    case WIFI_CIPHER_TYPE_GCMP: return "gcmp";
    case WIFI_CIPHER_TYPE_GCMP256: return "gcmp-256";
    case WIFI_CIPHER_TYPE_AES_GMAC128: return "aes-gmac128";
    case WIFI_CIPHER_TYPE_AES_GMAC256: return "aes-gmac256";
    default: return NULL;
    }
}

static JSValue driver_interface_config_to_js(JSContext *ctx, wifi_interface_t interface,
    const wifi_config_t *config, bool include_secrets, const char *operation)
{
#if !CONFIG_ESP32_MQUICKJS_WIFI_ALLOW_SECRET_READBACK
    include_secrets = false;
#endif
    bool station = interface == WIFI_IF_STA;
    const uint8_t *ssid = station ? config->sta.ssid : config->ap.ssid;
    const uint8_t *password = station ? config->sta.password : config->ap.password;
    size_t ssid_length = station || config->ap.ssid_len == 0
        ? strnlen((const char *)ssid, 32) : config->ap.ssid_len;
    if (ssid_length > 32 || (!station && config->ap.ssid_hidden > 1))
        return driver_read_error(ctx, station ? "station" : "access-point", operation,
            ESP_ERR_INVALID_RESPONSE, "decode");
    const wifi_pmf_config_t *pmf = station ? &config->sta.pmf_cfg : &config->ap.pmf_cfg;
    const char *pmf_name = !pmf->capable ? (pmf->required ? NULL : "disabled") : pmf->required ? "required" : "optional";
    JSGCRef result_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
#define SET(name, value) do { if (!esp32_mquickjs_set_property_ref(ctx, result, name, value)) goto fail; } while (0)
    SET("interface", JS_NewString(ctx, station ? "station" : "access-point"));
    SET("secretsIncluded", JS_NewBool(include_secrets));
    SET("ssid", driver_config_text(ctx, ssid, ssid_length));
    SET("password", include_secrets ? driver_config_text(ctx, password,
        strnlen((const char *)password, sizeof(config->sta.password))) : JS_NULL);
    SET("pmf", pmf_name != NULL ? JS_NewString(ctx, pmf_name) : JS_NULL);
#define NUMBER(name, field) SET(name, JS_NewInt32(ctx, c->field))
#define BOOLEAN(name, field) SET(name, JS_NewBool(c->field != 0))
#define ENUM(name, field, kind) SET(name, driver_config_enum(ctx, c->field, driver_config_##kind##_name(c->field)))
#define BYTES(name, field) SET(name, driver_config_bytes(ctx, (const uint8_t *)c->field, \
    strcmp(name, "ssidBytes") == 0 ? ssid_length : sizeof(c->field)))
#define SECRET(name, field) SET(name, include_secrets ? driver_config_bytes(ctx, (const uint8_t *)c->field, \
    strnlen((const char *)c->field, sizeof(c->field))) : JS_NULL)
    if (station) {
        const wifi_sta_config_t *c = &config->sta;
        WIFI_DRIVER_OBSERVE_STA(NUMBER, BOOLEAN, ENUM, BYTES, SECRET)
        char bssid[18];
        esp32_mquickjs_wireless_format_address(c->bssid, bssid);
        SET("bssid", JS_NewString(ctx, bssid));
        SET("saeH2eIdentifier", include_secrets ? driver_config_text(ctx, (const uint8_t *)c->sae_h2e_identifier,
            strnlen((const char *)c->sae_h2e_identifier, sizeof(c->sae_h2e_identifier))) : JS_NULL);
    } else {
        const wifi_ap_config_t *c = &config->ap;
        WIFI_DRIVER_OBSERVE_AP(NUMBER, BOOLEAN, ENUM, BYTES, SECRET)
    }
#undef SECRET
#undef BYTES
#undef ENUM
#undef BOOLEAN
#undef NUMBER
#undef SET
    return JS_PopGCRef(ctx, &result_ref);
fail:
    JS_PopGCRef(ctx, &result_ref);
    return JS_EXCEPTION;
}

static void driver_config_free(wifi_config_t *config)
{
    if (config == NULL) return;
    esp32_mquickjs_wireless_secure_zero(config, sizeof(*config));
    esp32_mquickjs_memory_payload_free(config);
}

