99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_driver/esp32_mquickjs_wifi_driver.c
JSValue js_wifi_driver_get_interface_config(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    if (argc < 1 || argc > 2) return JS_ThrowTypeError(ctx, "wifi.driver.getInterfaceConfig expects interface and optional options");
    wifi_interface_t interface;
    if (!tx_rate_interface(ctx, argv[0], &interface)) return JS_EXCEPTION;
    bool include_secrets = false;
    if (argc == 2) {
        static const char *const keys[] = {"includeSecrets"};
        JSGCRef options_ref, value_ref;
        JSValue *options = JS_PushGCRef(ctx, &options_ref);
        JSValue *value = JS_PushGCRef(ctx, &value_ref);
        *options = argv[1];
        bool valid = esp32_mquickjs_validate_plain_options(ctx, *options, "wifi.driver.getInterfaceConfig", keys, 1);
        if (valid) {
            *value = JS_GetPropertyStr(ctx, *options, "includeSecrets");
            valid = JS_IsUndefined(*value) || JS_IsBool(*value);
            include_secrets = *value == JS_TRUE;
        }
        JS_PopGCRef(ctx, &value_ref);
        JS_PopGCRef(ctx, &options_ref);
        if (!valid) return JS_HasException(ctx) ? JS_EXCEPTION : JS_ThrowTypeError(ctx, "includeSecrets must be boolean");
    }
#if !CONFIG_ESP32_MQUICKJS_WIFI_ALLOW_SECRET_READBACK
    if (include_secrets) return driver_read_error(ctx, interface == WIFI_IF_STA ? "station" : "access-point",
        "wifi.driver.getInterfaceConfig", ESP_ERR_NOT_ALLOWED, "secret-readback");
#endif
    wifi_config_t *config = esp32_mquickjs_memory_wireless_calloc("wifi.driver", 1, sizeof(*config),
        ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (config == NULL) return JS_ThrowOutOfMemory(ctx);
    const char *stage;
    esp_err_t err = esp32_mquickjs_wifi_radio_read_interface_config(interface, include_secrets, config, &stage);
    if (err != ESP_OK) {
        driver_config_free(config);
        return driver_read_error(ctx, interface == WIFI_IF_STA ? "station" : "access-point",
            "wifi.driver.getInterfaceConfig", err, stage);
    }
    JSValue result = driver_interface_config_to_js(ctx, interface, config, include_secrets, "wifi.driver.getInterfaceConfig");
    driver_config_free(config);
    return result;
}

JSValue js_wifi_driver_set_interface_config(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    if (argc != 2) return JS_ThrowTypeError(ctx, "wifi.driver.setInterfaceConfig expects interface and complete config");
    wifi_interface_t interface;
    if (!tx_rate_interface(ctx, argv[0], &interface)) return JS_EXCEPTION;
    wifi_config_t *config = esp32_mquickjs_memory_wireless_calloc("wifi.driver", 1, sizeof(*config),
        ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (config == NULL) return JS_ThrowOutOfMemory(ctx);
    if (!esp32_mquickjs_wifi_parse_driver_config_for_operation(ctx, argv[1], interface, config, "wifi.driver.setInterfaceConfig")) {
        driver_config_free(config);
        return JS_EXCEPTION;
    }
    esp32_mquickjs_wifi_radio_config_result_t native;
    esp_err_t err = esp32_mquickjs_wifi_radio_write_interface_config(interface, config, &native);
    if (err != ESP_OK) {
        driver_config_free(config);
        return driver_phy_write_error(ctx, interface, "wifi.driver.setInterfaceConfig", &native);
    }
    JSValue result = driver_interface_config_to_js(ctx, interface, config, false, "wifi.driver.setInterfaceConfig");
    driver_config_free(config);
    return result;
}

JSValue js_wifi_driver_set_country_details(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    if (argc != 1) return JS_ThrowTypeError(ctx, "wifi.driver.setCountryDetails expects one complete configuration");
    wifi_country_t requested, actual;
    if (!esp32_mquickjs_wifi_capture_country_details(ctx, argv[0], &requested)) return JS_EXCEPTION;
    esp32_mquickjs_wifi_radio_config_result_t result;
    esp_err_t err = esp32_mquickjs_wifi_radio_set_country_details(&requested, &actual, &result);
    if (err != ESP_OK) return driver_phy_write_error(ctx, WIFI_IF_MAX, "wifi.driver.setCountryDetails", &result);
    /* max_tx_power is read-only, so the returned snapshot must be constructed
     * from actual native readback. A delivery OOM does not repeat the write. */
    return esp32_mquickjs_wifi_country_to_js(ctx, &actual);
}

static bool driver_antenna_capture(JSContext *ctx, JSValue input, bool gpio,
    esp32_mquickjs_wifi_antenna_snapshot_t *snapshot)
{
    static const char *const config_keys[] = {"rxMode", "txMode", "rxDefault", "enabledAnt0", "enabledAnt1"};
    static const char *const gpio_keys[] = {"gpios"};
    static const char *const pin_keys[] = {"selected", "gpio"};
    static const char *const modes[] = {"ant0", "ant1", "auto"};
    static const esp_phy_ant_mode_t native_modes[] = {ESP_PHY_ANT_MODE_ANT0, ESP_PHY_ANT_MODE_ANT1, ESP_PHY_ANT_MODE_AUTO};
    JSGCRef input_ref, array_ref, item_ref, value_ref;
    JSValue *options = JS_PushGCRef(ctx, &input_ref);
    JSValue *array = JS_PushGCRef(ctx, &array_ref);
    JSValue *item = JS_PushGCRef(ctx, &item_ref);
    JSValue *value = JS_PushGCRef(ctx, &value_ref);
    *options = input;
    memset(snapshot, 0, sizeof(*snapshot));
    if (!esp32_mquickjs_validate_plain_options(ctx, *options, "Wi-Fi antenna config",
        gpio ? gpio_keys : config_keys, gpio ? 1 : 5)) goto fail;
    if (gpio) {
        *array = JS_GetPropertyStr(ctx, *options, "gpios");
        if (JS_IsException(*array)) goto fail;
        if (!JS_IsArray(ctx, *array)) goto invalid;
        *value = JS_GetPropertyStr(ctx, *array, "length");
        if (JS_IsException(*value)) goto fail;
        uint32_t length;
        if (!esp32_mquickjs_value_to_bounded_u32(ctx, *value, 4, 4, &length)) goto invalid;
        for (unsigned i = 0; i < 4; ++i) {
            *item = JS_GetPropertyUint32(ctx, *array, i);
            if (JS_IsException(*item)) goto fail;
            if (!esp32_mquickjs_validate_plain_options(ctx, *item, "Wi-Fi antenna GPIO", pin_keys, 2)) goto fail;
            *value = JS_GetPropertyStr(ctx, *item, "selected");
            if (JS_IsException(*value)) goto fail;
            if (!JS_IsBool(*value)) goto invalid;
            snapshot->gpio.gpio_cfg[i].gpio_select = *value == JS_TRUE;
            *value = JS_GetPropertyStr(ctx, *item, "gpio");
            if (JS_IsException(*value)) goto fail;
            uint32_t pin;
            if (!esp32_mquickjs_value_to_bounded_u32(ctx, *value, 0, 127, &pin)) goto invalid;
            snapshot->gpio.gpio_cfg[i].gpio_num = pin;
        }
    } else {
        for (unsigned i = 0; i < 5; ++i) {
            *value = JS_GetPropertyStr(ctx, *options, config_keys[i]);
            if (JS_IsException(*value)) goto fail;
            if (i < 3) {
                size_t mode;
                if (!esp32_mquickjs_value_to_enum(ctx, *value, modes, i == 2 ? 2 : 3, &mode)) goto invalid;
                if (i == 0) snapshot->config.rx_ant_mode = native_modes[mode];
                else if (i == 1) snapshot->config.tx_ant_mode = native_modes[mode];
                else snapshot->config.rx_ant_default = mode == 0 ? ESP_PHY_ANT_ANT0 : ESP_PHY_ANT_ANT1;
            } else {
                uint32_t selector;
                if (!esp32_mquickjs_value_to_bounded_u32(ctx, *value, 0, 15, &selector)) goto invalid;
                if (i == 3) snapshot->config.enabled_ant0 = selector;
                else snapshot->config.enabled_ant1 = selector;
            }
        }
        if (!esp32_mquickjs_wifi_antenna_valid(&snapshot->config)) goto invalid;
    }
    JS_PopGCRef(ctx, &value_ref);
    JS_PopGCRef(ctx, &item_ref);
    JS_PopGCRef(ctx, &array_ref);
    JS_PopGCRef(ctx, &input_ref);
    return true;
invalid:
    if (!JS_HasException(ctx)) JS_ThrowTypeError(ctx, "Invalid or incomplete Wi-Fi antenna configuration");
fail:
    JS_PopGCRef(ctx, &value_ref);
    JS_PopGCRef(ctx, &item_ref);
    JS_PopGCRef(ctx, &array_ref);
    JS_PopGCRef(ctx, &input_ref);
    return false;
}

static JSValue driver_write_antenna(JSContext *ctx, int argc, JSValue *argv, bool gpio, const char *operation)
{
    if (argc != 1) return JS_ThrowTypeError(ctx, "%s expects one complete configuration", operation);
    esp32_mquickjs_wifi_antenna_snapshot_t snapshot;
    if (!driver_antenna_capture(ctx, argv[0], gpio, &snapshot)) return JS_EXCEPTION;
    /* Finish all user getters and success-result allocations before mutation.
     * The native transaction performs semantic readback against this capture. */
    JSGCRef output_ref;
    JSValue *output = JS_PushGCRef(ctx, &output_ref);
    *output = driver_antenna_to_js(ctx, gpio, &snapshot);
    if (JS_IsException(*output)) { JS_PopGCRef(ctx, &output_ref); return JS_EXCEPTION; }
    esp32_mquickjs_wifi_radio_config_result_t result;
    esp_err_t error = esp32_mquickjs_wifi_radio_write_antenna(gpio, &snapshot, &result);
    if (error != ESP_OK) {
        JS_PopGCRef(ctx, &output_ref);
        return driver_phy_write_error(ctx, WIFI_IF_MAX, operation, &result);
    }
    return JS_PopGCRef(ctx, &output_ref);
}

JSValue js_wifi_driver_set_antenna(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    return driver_write_antenna(ctx, argc, argv, false, "wifi.driver.setAntenna");
}

JSValue js_wifi_driver_set_antenna_gpio(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    return driver_write_antenna(ctx, argc, argv, true, "wifi.driver.setAntennaGpio");
}

JSValue esp32_mquickjs_wifi_policies_to_js(JSContext *ctx)
{
    static const char *const names[ESP32_MQUICKJS_WIFI_POLICY_SLOT_COUNT] = {
        "dynamicCarrierSense", "station11bDisabled", "accessPoint11bDisabled", "coexistencePowerManagement",
#if CONFIG_SOC_WIFI_HE_SUPPORT
        "bssColorCollisionReporting",
#endif
    };
    esp32_mquickjs_wifi_policy_state_t state;
    esp32_mquickjs_wifi_radio_policy_status(&state);
    JSGCRef root_ref, entry_ref;
    JSValue *root = JS_PushGCRef(ctx, &root_ref);
    JSValue *entry = JS_PushGCRef(ctx, &entry_ref);
    *root = JS_NewObject(ctx);
    if (JS_IsException(*root) ||
        !esp32_mquickjs_set_property_ref(ctx, root, "revision", JS_NewUint32(ctx, state.revision)) ||
        !esp32_mquickjs_set_property_ref(ctx, root, "identityExhausted", JS_NewBool(state.revision == UINT32_MAX))) goto fail;
    for (unsigned i = 0; i < ESP32_MQUICKJS_WIFI_POLICY_SLOT_COUNT; ++i) {
        const esp32_mquickjs_wifi_policy_record_t *record = &state.records[i];
        *entry = JS_NewObject(ctx);
        if (JS_IsException(*entry) ||
            !esp32_mquickjs_set_property_ref(ctx, entry, "generation", JS_NewUint32(ctx, record->generation)) ||
            !esp32_mquickjs_set_property_ref(ctx, entry, "revision", JS_NewUint32(ctx, record->revision)) ||
            !esp32_mquickjs_set_property_ref(ctx, entry, "acceptedRevision", JS_NewUint32(ctx, record->accepted_revision)) ||
            !esp32_mquickjs_set_property_ref(ctx, entry, "configured", JS_NewBool(record->configured)) ||
            !esp32_mquickjs_set_property_ref(ctx, entry, "known", JS_NewBool(record->known)) ||
            !esp32_mquickjs_set_property_ref(ctx, entry, "uncertain", JS_NewBool(record->uncertain)) ||
            !esp32_mquickjs_set_property_ref(ctx, entry, "requested", record->revision != 0U ? JS_NewBool(record->requested) : JS_NULL) ||
            !esp32_mquickjs_set_property_ref(ctx, entry, "value", record->known ? JS_NewBool(record->value) : JS_NULL) ||
            !esp32_mquickjs_set_property_ref(ctx, entry, "lastAcceptedValue", record->configured ? JS_NewBool(record->value) : JS_NULL) ||
            !esp32_mquickjs_set_property_ref(ctx, entry, "error", JS_NewInt32(ctx, record->error)) ||
            !esp32_mquickjs_set_property_ref(ctx, root, names[i], *entry)) goto fail;
    }
    JSValue result = *root;
    JS_PopGCRef(ctx, &entry_ref);
    JS_PopGCRef(ctx, &root_ref);
    return result;
fail:
    JS_PopGCRef(ctx, &entry_ref);
    JS_PopGCRef(ctx, &root_ref);
    return JS_EXCEPTION;
}

JSValue esp32_mquickjs_wifi_rssi_request_to_js(JSContext *ctx)
{
    esp32_mquickjs_wifi_rssi_request_t state;
    bool generation_active = esp32_mquickjs_wifi_radio_rssi_request_status(&state);
    bool attempted = state.revision != 0U;
    JSGCRef ref;
    JSValue *value = JS_PushGCRef(ctx, &ref);
    *value = JS_NewObject(ctx);
    if (JS_IsException(*value) ||
        !esp32_mquickjs_set_property_ref(ctx, value, "revision", JS_NewUint32(ctx, state.revision)) ||
        !esp32_mquickjs_set_property_ref(ctx, value, "identityExhausted", JS_NewBool(state.revision == UINT32_MAX)) ||
        !esp32_mquickjs_set_property_ref(ctx, value, "generation", attempted ? JS_NewUint32(ctx, state.generation) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, value, "generationActive", JS_NewBool(generation_active)) ||
        !esp32_mquickjs_set_property_ref(ctx, value, "requestedDbm", attempted ? JS_NewInt32(ctx, state.requested_dbm) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, value, "accepted", JS_NewBool(attempted && state.error == ESP_OK)) ||
        !esp32_mquickjs_set_property_ref(ctx, value, "espCode", attempted ? JS_NewInt32(ctx, state.error) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, value, "espName", attempted ? JS_NewString(ctx, esp_err_to_name(state.error)) : JS_NULL)) {
        JS_PopGCRef(ctx, &ref);
        return JS_EXCEPTION;
    }
    JSValue result = *value;
    JS_PopGCRef(ctx, &ref);
    return result;
}

JSValue esp32_mquickjs_wifi_interval_to_js(JSContext *ctx)
{
    esp32_mquickjs_wifi_interval_state_t state;
    esp32_mquickjs_wifi_radio_interval_status(&state);
    JSGCRef ref;
    JSValue *value = JS_PushGCRef(ctx, &ref);
    *value = JS_NewObject(ctx);
    if (JS_IsException(*value) ||
        !esp32_mquickjs_set_property_ref(ctx, value, "generation", JS_NewUint32(ctx, state.generation)) ||
        !esp32_mquickjs_set_property_ref(ctx, value, "revision", JS_NewUint32(ctx, state.revision)) ||
        !esp32_mquickjs_set_property_ref(ctx, value, "known", JS_NewBool(state.known)) ||
        !esp32_mquickjs_set_property_ref(ctx, value, "uncertain", JS_NewBool(state.uncertain)) ||
        !esp32_mquickjs_set_property_ref(ctx, value, "milliseconds", state.known ? JS_NewInt32(ctx, state.value) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, value, "previousMilliseconds", state.owner.identity != 0U ? JS_NewInt32(ctx, state.previous) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, value, "ownerIdentity", JS_NewUint32(ctx, state.owner.owner_identity)) ||
        !esp32_mquickjs_set_property_ref(ctx, value, "tokenIdentity", JS_NewUint32(ctx, state.owner.identity)) ||
        !esp32_mquickjs_set_property_ref(ctx, value, "restorePending", JS_NewBool(state.restore_pending)) ||
        !esp32_mquickjs_set_property_ref(ctx, value, "error", JS_NewInt32(ctx, state.error)) ||
        !esp32_mquickjs_set_property_ref(ctx, value, "restoreError", JS_NewInt32(ctx, state.restore_error))) {
        JS_PopGCRef(ctx, &ref);
        return JS_EXCEPTION;
    }
    JSValue result = *value;
    JS_PopGCRef(ctx, &ref);
    return result;
}

