99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_driver/esp32_mquickjs_wifi_driver.c
JSValue js_wifi_driver_set_connectionless_wake_interval(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    uint32_t milliseconds;
    if (argc != 1 || !esp32_mquickjs_value_to_bounded_u32(ctx, argv[0], 0, UINT16_MAX, &milliseconds)) {
        if (JS_HasException(ctx)) return JS_EXCEPTION;
        return JS_ThrowTypeError(ctx, "wifi.driver.setConnectionlessWakeInterval expects integer milliseconds 0..65535 (0 selects default mode)");
    }
    esp32_mquickjs_wifi_radio_config_result_t result;
    esp_err_t err = esp32_mquickjs_wifi_apply_interval((uint16_t)milliseconds, &result);
    if (err != ESP_OK) return driver_phy_write_error(ctx, WIFI_IF_MAX, "wifi.driver.setConnectionlessWakeInterval", &result);
    return JS_NewUint32(ctx, milliseconds);
}

static JSValue driver_write_policy(JSContext *ctx, int argc, JSValue *argv,
    esp32_mquickjs_wifi_policy_control_t control, const char *operation)
{
    bool by_interface = control == ESP32_MQUICKJS_WIFI_POLICY_11B_RATE;
    if (argc != (by_interface ? 2 : 1)) return JS_ThrowTypeError(ctx, "%s has invalid argument count", operation);
    wifi_interface_t interface = WIFI_IF_MAX;
    if (by_interface && !tx_rate_interface(ctx, argv[0], &interface)) return JS_EXCEPTION;
    JSValue value = argv[by_interface ? 1 : 0];
    if (!JS_IsBool(value)) return JS_ThrowTypeError(ctx, "%s expects a boolean", operation);
    bool accepted;
    esp32_mquickjs_wifi_radio_config_result_t result;
    esp_err_t err = esp32_mquickjs_wifi_apply_policy(control, interface, value == JS_TRUE, &accepted, &result);
    if (err != ESP_OK) return driver_phy_write_error(ctx, interface, operation, &result);
    return JS_NewBool(accepted);
}

JSValue js_wifi_driver_set_dynamic_carrier_sense(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    return driver_write_policy(ctx, argc, argv, ESP32_MQUICKJS_WIFI_POLICY_DYNAMIC_CS, "wifi.driver.setDynamicCarrierSense");
}

JSValue js_wifi_driver_configure_11b_rate(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    return driver_write_policy(ctx, argc, argv, ESP32_MQUICKJS_WIFI_POLICY_11B_RATE, "wifi.driver.configure11bRate");
}

JSValue js_wifi_driver_set_coexistence_power_management(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    return driver_write_policy(ctx, argc, argv, ESP32_MQUICKJS_WIFI_POLICY_COEX_POWER, "wifi.driver.setCoexistencePowerManagement");
}

JSValue js_wifi_driver_set_bss_color_collision_reporting(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    return driver_write_policy(ctx, argc, argv, ESP32_MQUICKJS_WIFI_POLICY_BSS_COLOR,
        "wifi.driver.setBssColorCollisionReporting");
}

JSValue js_wifi_driver_get_event_mask(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argv;
    if (argc != 0) return JS_ThrowTypeError(ctx, "wifi.driver.getEventMask expects no arguments");
    uint32_t actual;
    esp32_mquickjs_wifi_radio_config_result_t result;
    esp_err_t err = esp32_mquickjs_wifi_radio_event_mask(false, 0, &actual, &result);
    if (err != ESP_OK) return driver_read_error(ctx, NULL, "wifi.driver.getEventMask", err, result.stage);
    return JS_NewUint32(ctx, actual);
}

JSValue js_wifi_driver_set_event_mask(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    uint32_t requested;
    if (argc != 1 || !esp32_mquickjs_value_to_bounded_u32(ctx, argv[0], 0, UINT32_MAX, &requested) ||
        (requested & ~((uint32_t)WIFI_EVENT_MASK_AP_PROBEREQRECVED)) != 0U) {
        if (JS_HasException(ctx)) return JS_EXCEPTION;
        return JS_ThrowTypeError(ctx, "wifi.driver.setEventMask expects 0 or the AP probe-request mask (1); control/unknown bits are reserved");
    }
    uint32_t actual;
    esp32_mquickjs_wifi_radio_config_result_t result;
    esp_err_t err = esp32_mquickjs_wifi_radio_event_mask(true, requested, &actual, &result);
    if (err != ESP_OK) return driver_phy_write_error(ctx, WIFI_IF_MAX, "wifi.driver.setEventMask", &result);
    return JS_NewUint32(ctx, actual);
}

JSValue js_wifi_driver_restore(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val; (void)argv;
    if (argc != 0) return JS_ThrowTypeError(ctx, "wifi.driver.restore() takes no arguments");
    esp32_mquickjs_wifi_radio_config_result_t result;
    esp_err_t err = esp32_mquickjs_wifi_radio_restore(&result);
    return err == ESP_OK ? JS_TRUE : driver_phy_write_error(ctx, WIFI_IF_MAX, "wifi.driver.restore", &result);
}

JSValue js_wifi_driver_set_mode(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    static const char *const names[] = {"off", "station", "softAP", "station+softAP"};
    static const wifi_mode_t modes[] = {WIFI_MODE_NULL, WIFI_MODE_STA, WIFI_MODE_AP, WIFI_MODE_APSTA};
    size_t choice;
    if (argc != 1 || !esp32_mquickjs_value_to_enum(ctx, argv[0], names, sizeof(names) / sizeof(*names), &choice)) {
        if (JS_HasException(ctx)) return JS_EXCEPTION;
        return JS_ThrowTypeError(ctx, "wifi.driver.setMode expects off, station, softAP or station+softAP");
    }
    JSGCRef input_ref;
    JSValue *input = JS_PushGCRef(ctx, &input_ref);
    *input = argv[0];
    esp32_mquickjs_wifi_radio_config_result_t result;
    esp_err_t err = esp32_mquickjs_wifi_radio_set_mode(modes[choice], &result);
    JSValue output = err == ESP_OK ? *input : driver_phy_write_error(ctx, WIFI_IF_MAX, "wifi.driver.setMode", &result);
    JS_PopGCRef(ctx, &input_ref);
    return output;
}

JSValue js_wifi_driver_set_storage(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    if (argc != 1 || !JS_IsString(ctx, argv[0]))
        return JS_ThrowTypeError(ctx, "wifi.driver.setStorage expects ram or flash");
    JSCStringBuf buffer;
    size_t length;
    const char *text = JS_ToCStringLen(ctx, &length, argv[0], &buffer);
    if (text == NULL) return JS_EXCEPTION;
    wifi_storage_t storage;
    if (length == 3 && memcmp(text, "ram", 3) == 0) storage = WIFI_STORAGE_RAM;
    else if (length == 5 && memcmp(text, "flash", 5) == 0) storage = WIFI_STORAGE_FLASH;
    else return JS_ThrowTypeError(ctx, "wifi.driver.setStorage expects ram or flash");
    /* Return the rooted validated input; no result allocation after mutation. */
    JSGCRef input_ref;
    JSValue *input = JS_PushGCRef(ctx, &input_ref);
    *input = argv[0];
    esp32_mquickjs_wifi_radio_config_result_t result;
    esp_err_t err = esp32_mquickjs_wifi_radio_set_storage(storage, &result);
    JSValue output = err == ESP_OK ? *input :
        driver_phy_write_error(ctx, WIFI_IF_MAX, "wifi.driver.setStorage", &result);
    JS_PopGCRef(ctx, &input_ref);
    return output;
}

JSValue js_wifi_driver_disable_pmf(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    if (argc != 1) return JS_ThrowTypeError(ctx, "wifi.driver.disablePmf(interface) expects one argument");
    wifi_interface_t interface;
    if (!tx_rate_interface(ctx, argv[0], &interface)) return JS_EXCEPTION;
    esp32_mquickjs_wifi_radio_config_result_t result;
    esp_err_t err = esp32_mquickjs_wifi_radio_disable_pmf(interface, &result);
    if (err != ESP_OK) return driver_phy_write_error(ctx, interface, "wifi.driver.disablePmf", &result);
    return JS_UNDEFINED;
}

static JSValue driver_write_phy(JSContext *ctx, int argc, JSValue *argv,
    esp32_mquickjs_wifi_phy_query_t query, const char *operation)
{
    if (argc != 2) return JS_ThrowTypeError(ctx, "%s(interface, config) expects two arguments", operation);
    wifi_interface_t interface;
    if (!tx_rate_interface(ctx, argv[0], &interface)) return JS_EXCEPTION;
    esp32_mquickjs_wifi_phy_readback_t requested, actual;
    if (!driver_phy_capture(ctx, argv[1], query, &requested)) return JS_EXCEPTION;
    esp32_mquickjs_wifi_radio_config_result_t result;
    esp_err_t err = esp32_mquickjs_wifi_radio_write_phy(interface, query, &requested, &actual, &result);
    if (err != ESP_OK) return driver_phy_write_error(ctx, interface, operation, &result);
    /* Mutation is committed before conversion. Inspect getters/status after OOM. */
    return driver_phy_to_js(ctx, query, &actual);
}

JSValue js_wifi_driver_set_protocol(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    return driver_write_phy(ctx, argc, argv, ESP32_MQUICKJS_WIFI_PHY_PROTOCOL, "wifi.driver.setProtocol");
}

JSValue js_wifi_driver_set_protocols(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    return driver_write_phy(ctx, argc, argv, ESP32_MQUICKJS_WIFI_PHY_PROTOCOLS, "wifi.driver.setProtocols");
}

JSValue js_wifi_driver_set_bandwidth(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    return driver_write_phy(ctx, argc, argv, ESP32_MQUICKJS_WIFI_PHY_BANDWIDTH, "wifi.driver.setBandwidth");
}

JSValue js_wifi_driver_set_bandwidths(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    return driver_write_phy(ctx, argc, argv, ESP32_MQUICKJS_WIFI_PHY_BANDWIDTHS, "wifi.driver.setBandwidths");
}

static bool driver_rx_statistics_capture(JSContext *ctx, JSValue input, uint8_t *selection)
{
    static const char *const keys[] = {"ordinary", "multiUser"};
    JSGCRef options_ref, value_ref;
    JSValue *options = JS_PushGCRef(ctx, &options_ref), *value = JS_PushGCRef(ctx, &value_ref);
    *options = input;
    *selection = 0;
    bool success = false;
    if (!esp32_mquickjs_validate_plain_options(ctx, *options, "wifi.driver.configureRxStatistics", keys, 2)) goto done;
    for (unsigned i = 0; i < 2; ++i) {
        *value = JS_GetPropertyStr(ctx, *options, keys[i]);
        if (JS_IsException(*value)) goto done;
        if (!JS_IsBool(*value)) {
            JS_ThrowTypeError(ctx, "RX statistics require ordinary and multiUser booleans");
            goto done;
        }
        if (*value == JS_TRUE) *selection |= 1U << i;
    }
    success = true;
done:
    JS_PopGCRef(ctx, &value_ref);
    JS_PopGCRef(ctx, &options_ref);
    return success;
}

static JSValue driver_rx_statistics_to_js(JSContext *ctx, const esp32_mquickjs_wifi_he_statistics_t *actual)
{
    JSGCRef ref;
    JSValue *result = JS_PushGCRef(ctx, &ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "ordinary", JS_NewBool(actual->ordinary)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "multiUser", JS_NewBool(actual->multi_user))) {
        JS_PopGCRef(ctx, &ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &ref);
}

static const char *const driver_statistics_categories[] = {"voice", "video", "bestEffort", "background"};

JSValue js_wifi_driver_get_statistics_config(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val; (void)argv;
    if (argc != 0) return JS_ThrowTypeError(ctx, "wifi.driver.getStatisticsConfig() expects no arguments");
    esp32_mquickjs_wifi_he_statistics_t actual;
    const char *stage;
    esp_err_t error = esp32_mquickjs_wifi_radio_read_he_statistics(&actual, &stage);
    if (error != ESP_OK) return driver_read_error(ctx, NULL, "wifi.driver.getStatisticsConfig", error, stage);
    JSGCRef result_ref, tx_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref), *tx = JS_PushGCRef(ctx, &tx_ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
    *tx = JS_NewObject(ctx);
    if (JS_IsException(*tx)) goto fail;
    for (unsigned i = 0; i < 4; ++i)
        if (!esp32_mquickjs_set_property_ref(ctx, tx, driver_statistics_categories[i],
            JS_NewBool((actual.tx_mask & (1U << i)) != 0))) goto fail;
    if (!esp32_mquickjs_set_property_ref(ctx, result, "tx", *tx) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "rx", driver_rx_statistics_to_js(ctx, &actual))) goto fail;
    JS_PopGCRef(ctx, &tx_ref);
    return JS_PopGCRef(ctx, &result_ref);
fail:
    JS_PopGCRef(ctx, &tx_ref);
    JS_PopGCRef(ctx, &result_ref);
    return JS_EXCEPTION;
}

