99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_driver/esp32_mquickjs_wifi_driver.c
JSValue js_wifi_driver_configure_rx_statistics(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    if (argc != 1) return JS_ThrowTypeError(ctx, "wifi.driver.configureRxStatistics(config) expects one argument");
    uint8_t selection;
    if (!driver_rx_statistics_capture(ctx, argv[0], &selection)) return JS_EXCEPTION;
    esp32_mquickjs_wifi_he_statistics_t actual;
    esp32_mquickjs_wifi_radio_config_result_t result;
    esp_err_t error = esp32_mquickjs_wifi_apply_he_statistics(true, selection, false, &actual, &result);
    if (error != ESP_OK) return driver_phy_write_error(ctx, WIFI_IF_MAX, "wifi.driver.configureRxStatistics", &result);
    return driver_rx_statistics_to_js(ctx, &actual);
}

JSValue js_wifi_driver_set_tx_statistics(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    if (argc != 2 || !JS_IsString(ctx, argv[0]) || !JS_IsBool(argv[1]))
        return JS_ThrowTypeError(ctx, "wifi.driver.setTxStatistics expects an access category and boolean");
    bool enabled = argv[1] == JS_TRUE;
    JSCStringBuf buffer;
    size_t length;
    const char *category = JS_ToCStringLen(ctx, &length, argv[0], &buffer);
    if (category == NULL) return JS_EXCEPTION;
    unsigned selection;
    for (selection = 0; selection < 4; ++selection)
        if (length == strlen(driver_statistics_categories[selection]) &&
            memcmp(category, driver_statistics_categories[selection], length) == 0) break;
    if (selection == 4) return JS_ThrowTypeError(ctx, "Access category must be voice, video, bestEffort or background");
    esp32_mquickjs_wifi_he_statistics_t actual;
    esp32_mquickjs_wifi_radio_config_result_t result;
    esp_err_t error = esp32_mquickjs_wifi_apply_he_statistics(false, (uint8_t)selection, enabled, &actual, &result);
    if (error != ESP_OK) return driver_phy_write_error(ctx, WIFI_IF_MAX, "wifi.driver.setTxStatistics", &result);
    return JS_NewBool((actual.tx_mask & (1U << selection)) != 0);
}

static bool driver_scan_parameters_capture(JSContext *ctx, JSValue input,
    wifi_scan_default_params_t *parameters)
{
    static const char *const keys[] = {"activeMinMs", "activeMaxMs", "passiveMs", "homeChannelDwellMs"};
    JSGCRef options_ref, value_ref;
    JSValue *options = JS_PushGCRef(ctx, &options_ref), *value = JS_PushGCRef(ctx, &value_ref);
    *options = input;
    uint32_t fields[4] = {0};
    bool success = false;
    memset(parameters, 0, sizeof(*parameters));
    if (!esp32_mquickjs_validate_plain_options(ctx, *options, "wifi.driver.setScanParameters", keys, 4)) goto done;
    for (unsigned i = 0; i < 4; ++i) {
        *value = JS_GetPropertyStr(ctx, *options, keys[i]);
        if (JS_IsException(*value)) goto done;
        if (!esp32_mquickjs_value_to_bounded_u32(ctx, *value, 0, i == 3 ? 150 : 1500, &fields[i])) {
            if (!JS_HasException(ctx)) JS_ThrowTypeError(ctx, "Scan parameters require four integer millisecond fields");
            goto done;
        }
    }
    parameters->scan_time.active.min = fields[0];
    parameters->scan_time.active.max = fields[1];
    parameters->scan_time.passive = fields[2];
    parameters->home_chan_dwell_time = (uint8_t)fields[3];
    if (!wifi_scan_parameters_valid(parameters)) {
        JS_ThrowTypeError(ctx, "Scan minimum must not exceed effective maximum; home dwell must be 0 or 30..150 ms");
        goto done;
    }
    success = true;
done:
    JS_PopGCRef(ctx, &value_ref);
    JS_PopGCRef(ctx, &options_ref);
    return success;
}

static JSValue driver_scan_parameters_to_js(JSContext *ctx, const wifi_scan_default_params_t *parameters)
{
    JSGCRef result_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "activeMinMs", JS_NewUint32(ctx, parameters->scan_time.active.min)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "activeMaxMs", JS_NewUint32(ctx, parameters->scan_time.active.max)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "passiveMs", JS_NewUint32(ctx, parameters->scan_time.passive)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "homeChannelDwellMs", JS_NewUint32(ctx, parameters->home_chan_dwell_time))) {
        JS_PopGCRef(ctx, &result_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &result_ref);
}

JSValue js_wifi_driver_get_scan_parameters(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val; (void)argv;
    if (argc != 0) return JS_ThrowTypeError(ctx, "wifi.driver.getScanParameters() expects no arguments");
    wifi_scan_default_params_t actual;
    const char *stage;
    esp_err_t error = esp32_mquickjs_wifi_radio_read_scan_parameters(&actual, &stage);
    if (error != ESP_OK) return driver_read_error(ctx, "station", "wifi.driver.getScanParameters", error, stage);
    return driver_scan_parameters_to_js(ctx, &actual);
}

JSValue js_wifi_driver_set_scan_parameters(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    if (argc != 1) return JS_ThrowTypeError(ctx, "wifi.driver.setScanParameters(config|null) expects one argument");
    bool reset = JS_IsNull(argv[0]);
    wifi_scan_default_params_t requested, actual;
    if (!reset && !driver_scan_parameters_capture(ctx, argv[0], &requested)) return JS_EXCEPTION;
    esp32_mquickjs_wifi_radio_config_result_t result;
    esp_err_t error = esp32_mquickjs_wifi_apply_scan_parameters(reset ? NULL : &requested, &actual, &result);
    if (error != ESP_OK) return driver_phy_write_error(ctx, WIFI_IF_STA, "wifi.driver.setScanParameters", &result);
    /* Native state is committed before JS conversion; OOM cannot undo it. */
    return driver_scan_parameters_to_js(ctx, &actual);
}

static JSValue driver_connection_control(JSContext *ctx, int argc, JSValue *argv,
    esp32_mquickjs_wifi_connection_control_t control, const char *operation)
{
    bool observer = control == ESP32_MQUICKJS_WIFI_CONNECTION_RSSI_THRESHOLD;
    if (argc != (observer ? 1 : 2)) return JS_ThrowTypeError(ctx, "%s expects %d arguments", operation, observer ? 1 : 2);
    wifi_interface_t interface = WIFI_IF_STA;
    if (!observer && !tx_rate_interface(ctx, argv[0], &interface)) return JS_EXCEPTION;
    int32_t requested;
    if (!esp32_mquickjs_value_to_bounded_i32(ctx, argv[observer ? 0 : 1],
        observer ? -100 : interface == WIFI_IF_STA ? 3 : 10, observer ? 10 : UINT16_MAX, &requested)) {
        if (JS_HasException(ctx)) return JS_EXCEPTION;
        return JS_ThrowTypeError(ctx, observer ? "RSSI threshold must be an integer from -100 to 10 dBm"
            : "Inactive time must be integer seconds: Station 3..65535, AP 10..65535");
    }
    int32_t actual;
    esp32_mquickjs_wifi_radio_config_result_t result;
    esp_err_t err = esp32_mquickjs_wifi_apply_connection_control(control, interface, requested, &actual, &result);
    if (err != ESP_OK) return driver_phy_write_error(ctx, interface, operation, &result);
    return JS_NewInt32(ctx, actual);
}

JSValue js_wifi_driver_set_inactive_time(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    return driver_connection_control(ctx, argc, argv, ESP32_MQUICKJS_WIFI_CONNECTION_INACTIVE_TIME, "wifi.driver.setInactiveTime");
}

JSValue js_wifi_driver_set_rssi_threshold(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    return driver_connection_control(ctx, argc, argv, ESP32_MQUICKJS_WIFI_CONNECTION_RSSI_THRESHOLD, "wifi.driver.setRssiThreshold");
}

