99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_driver/esp32_mquickjs_wifi_driver.c
static JSValue driver_change_band(JSContext *ctx, int argc, JSValue *argv, bool band_mode)
{
    const char *operation = band_mode ? "wifi.driver.setBandMode" : "wifi.driver.setBand";
    static const char *const bands[] = {"2.4GHz", "5GHz"};
    static const char *const modes[] = {"2.4GHz-only", "5GHz-only", "auto"};
    size_t choice;
    if (argc != 1 || !esp32_mquickjs_value_to_enum(ctx, argv[0], band_mode ? modes : bands, band_mode ? 3 : 2, &choice)) {
        if (JS_HasException(ctx)) return JS_EXCEPTION;
        return JS_ThrowTypeError(ctx, "%s expects one exact band name", operation);
    }
    int32_t requested = band_mode ? (choice == 0 ? WIFI_BAND_MODE_2G_ONLY : choice == 1 ? WIFI_BAND_MODE_5G_ONLY : WIFI_BAND_MODE_AUTO)
        : (choice == 0 ? WIFI_BAND_2G : WIFI_BAND_5G);
    int32_t actual;
    esp32_mquickjs_wifi_radio_config_result_t result;
    esp_err_t err = esp32_mquickjs_wifi_apply_band(band_mode, requested, &actual, &result);
    if (err != ESP_OK) return driver_phy_write_error(ctx, WIFI_IF_STA, operation, &result);
    return driver_scalar_to_js(ctx, band_mode ? ESP32_MQUICKJS_WIFI_DRIVER_BAND_MODE : ESP32_MQUICKJS_WIFI_DRIVER_BAND, actual);
}

JSValue js_wifi_driver_set_band(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    return driver_change_band(ctx, argc, argv, false);
}

JSValue js_wifi_driver_set_band_mode(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    return driver_change_band(ctx, argc, argv, true);
}

JSValue js_wifi_driver_tx_rate_status(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    if (argc != 1) return JS_ThrowTypeError(ctx, "wifi.driver.txRateStatus(interface) expects one argument");
    wifi_interface_t interface;
    if (!tx_rate_interface(ctx, argv[0], &interface)) return JS_EXCEPTION;
    esp32_mquickjs_wifi_tx_rate_record_t record = {0};
    uint32_t generation = 0;
    esp32_mquickjs_wifi_tx_rate_lease_t temporary = {0};
    esp_err_t err = esp32_mquickjs_wifi_radio_tx_rate_status(interface, &record, &generation, &temporary);
    if (err != ESP_OK) {
        esp32_mquickjs_wifi_tx_rate_write_t write = {0};
        return tx_rate_error(ctx, "wifi.driver.txRateStatus", err, &write, interface, &record, generation, &temporary);
    }
    return tx_rate_status_to_js(ctx, interface, &record, generation, &temporary);
}

JSValue js_wifi_driver_configure_tx_rate(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    if (argc != 2) return JS_ThrowTypeError(ctx, "wifi.driver.configureTxRate(interface, config) expects two arguments");
    wifi_interface_t interface;
    if (!tx_rate_interface(ctx, argv[0], &interface)) return JS_EXCEPTION;
    wifi_tx_rate_config_t config;
    if (!esp32_mquickjs_wifi_tx_rate_capture(ctx, argv[1], &config)) return JS_EXCEPTION;
    esp32_mquickjs_wifi_tx_rate_write_t write;
    esp32_mquickjs_wifi_tx_rate_record_t record;
    uint32_t generation;
    esp32_mquickjs_wifi_tx_rate_lease_t temporary;
    esp_err_t err = esp32_mquickjs_wifi_radio_configure_tx_rate(interface, &config, &write, &record, &generation, &temporary);
    if (err != ESP_OK) return tx_rate_error(ctx, "wifi.driver.configureTxRate", err,
        &write, interface, &record, generation, &temporary);
    /* A JS allocation failure here cannot undo the accepted native write.
     * txRateStatus remains available to inspect it before any retry. */
    return tx_rate_status_to_js(ctx, interface, &record, generation, &temporary);
}
#endif
